#include "BaseShader.h"

//-------------------------------------------------------------------------------------------------
namespace DX11 {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
BaseShader::BaseShader()
	: mSize(0)
	, mData(nullptr)
{
}

//-------------------------------------------------------------------------------------------------
/// デストラクタ
BaseShader::~BaseShader()
{
	if (mData != nullptr)
	{
		delete[] mData;
	}
}

//-------------------------------------------------------------------------------------------------
/// シェーダのデータ（バイナリ）を返す
const char* BaseShader::data() const
{
	return mData;
}

//-------------------------------------------------------------------------------------------------
/// シェーダのデータサイズを返す
const long BaseShader::size() const
{
	return mSize;
}

//-------------------------------------------------------------------------------------------------
/// シェーダを読み込む
/// @param file_name 読み込み対象のファイル名
/// @return 読み込み結果 成功(true)
bool BaseShader::Load(const char* file_name)
{

}

} // namespace
// EOF
