#include "Game.h"

//-------------------------------------------------------------------------------------------------
#include "Direct3D11.h"

//-------------------------------------------------------------------------------------------------
namespace DX11 {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
Game::Game()
	: mSceneManager()
	, mFps()
{
}

//-------------------------------------------------------------------------------------------------
/// アプリケーションのメインループ
/// @return falseを返すとメインループを抜けてアプリケーションが終了する
bool Game::mainLoop()
{
	Direct3D11::getInst()->drawStart();

	mFps.update();
	mSceneManager.update();
	mSceneManager.draw();
	mFps.wait();
	mFps.draw();

	Direct3D11::getInst()->drawEnd();

	return true;
}

} // namespace
// EOF
