#include "GameScene.h"

//-------------------------------------------------------------------------------------------------
#include "ResourceManager.h"

//-------------------------------------------------------------------------------------------------
namespace KDXK {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
GameScene::GameScene(IChangeScene* aImpl) : AbstractScene(aImpl)
{
}

//-------------------------------------------------------------------------------------------------
/// デストラクタ
GameScene::~GameScene()
{
}

//-------------------------------------------------------------------------------------------------
/// 更新
void GameScene::update()
{
	// キャラクター
	mPlayer.setBossPos(mBoss.transform().pos);
	mPlayer.update();
	mBoss.update();

	// ワールド関連
	mCamera.setPlayerTransform(mPlayer.transform());
	mCamera.update();
	mDirectionalLight.update();
}

//-------------------------------------------------------------------------------------------------
/// 描画
void GameScene::draw()
{
	mPlayer.draw();
	mBoss.draw();
}

//-------------------------------------------------------------------------------------------------
/// 描画2D
void GameScene::draw2D()
{

}

//-------------------------------------------------------------------------------------------------
/// 背景描画
void GameScene::drawBackground()
{
	mSkyBox.draw();
}

} // namespace
// EOF
