#include "Player.h"

//-------------------------------------------------------------------------------------------------
#include "MyOutputDebugString.h" 
#include "ResourceFileName.h"
#include "InputManager.h"

//-------------------------------------------------------------------------------------------------
namespace KDXK {

//-------------------------------------------------------------------------------------------------
static const float MOVE_SPEED = 0.05f;

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
Player::Player()
{
	initialize();
}

//-------------------------------------------------------------------------------------------------
/// 初期化処理
void Player::initialize()
{
	// 描画設定
	mRenderer.setOBJ(ResourceFileName::OBJ.at(OBJList::Player));
	mRenderer.setShader(ResourceFileName::Shader.at(ShaderList::Standard));

	// 初期設定
	mDistanceFromBoss = 100;
	mPoseMat = DirectX::XMMatrixIdentity();
}

//-------------------------------------------------------------------------------------------------
/// 更新
void Player::update()
{
	move();
	shot();
}

//-------------------------------------------------------------------------------------------------
/// 描画
void Player::draw()
{
	mRenderer.render(mTransform);
}

//-------------------------------------------------------------------------------------------------
/// ボスの位置を設定する
/// @param aPos 
void Player::setBossPos(const Vector3& aPos)
{
	mBossPos = aPos;
}

//-------------------------------------------------------------------------------------------------
/// 移動
void Player::move()
{
}

//-------------------------------------------------------------------------------------------------
/// ショット
void Player::shot()
{

}

} // namespace
// EOF
