#include "Sphere.h"

//-------------------------------------------------------------------------------------------------
#include "ResourceFileName.h"

//-------------------------------------------------------------------------------------------------
namespace DX11 {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
Sphere::Sphere()
{
	initialize();
}

//-------------------------------------------------------------------------------------------------
/// 引数付きコンストラクタ
Sphere::Sphere(Transform aTransform)
{
	mTransform = aTransform;
	initialize();
}

//-------------------------------------------------------------------------------------------------
/// 初期化処理
void Sphere::initialize()
{
	mRenderer.setObjAndShaderData(
		ResourceFileName::OBJ.at(OBJList::Sphere),
		ResourceFileName::Shader.at(ShaderList::Standard)
	);
}

//-------------------------------------------------------------------------------------------------
/// 更新
void Sphere::update()
{
}

//-------------------------------------------------------------------------------------------------
/// 描画
void Sphere::draw()
{
	mRenderer.render(mTransform.XMFLOAT3X3());
}

} // namespace
// EOF
